Appendix1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                |
|   \\  /    A nd           | Web:      www.openfoam.com                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale		1; 
x_length  	2.4;
Y_Height  	0.12;
z_thickness 	0.01;	

vertices
(
    (0 		        0      		0)
    ($x_length 	0    		        0)
    ($x_length 	$Y_Height 	0)
    (0   	                $Y_Height 	0)
    (0   	                0    		        $z_thickness)
    ($x_length 	0    		        $z_thickness)
    ($x_length 	$Y_Height 	$z_thickness)
    (0   	                $Y_Height 	$z_thickness)
);

N_x	        #calc "$x_length*5*15";
N_y 	#calc "$Y_Height*5*100";


blocks
(
    hex (0 1 2 3 4 5 6 7) ($N_x $N_y 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topSolid_top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottomSolid_bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    leftLet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    rightLet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
