Appendix1/constant/bottomSolid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/bottomSolid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    bottomSolid_bottom
    {
        type            patch;
        nFaces          180;
        startFace       1615;
    }
    leftLet
    {
        type            patch;
        nFaces          5;
        startFace       1795;
    }
    rightLet
    {
        type            patch;
        nFaces          5;
        startFace       1800;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1800;
        startFace       1805;
    }
    bottomSolid_to_pipe
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          180;
        startFace       3605;
        sampleMode      nearestPatchFace;
        sampleRegion    pipe;
        samplePatch     pipe_to_bottomSolid;
    }
)

// ************************************************************************* //
