Appendix1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topSolid_top
    {
        type            patch;
        nFaces          180;
        startFace       21360;
    }
    bottomSolid_bottom
    {
        type            patch;
        nFaces          180;
        startFace       21540;
    }
    leftLet
    {
        type            patch;
        nFaces          60;
        startFace       21720;
    }
    rightLet
    {
        type            patch;
        nFaces          60;
        startFace       21780;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          21600;
        startFace       21840;
    }
)

// ************************************************************************* //
