Appendix1/constant/topSolid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                |
|   \\  /    A nd           | Web:      www.openfoam.com                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type                          heSolidThermo;
    mixture                    pureMixture;
    transport                 constIso;
    thermo                     hConst;
    equationOfState     rhoConst;
    specie                       specie;
    energy                      sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   50;
    }
    transport
    {
        kappa   80;
    }
    thermodynamics
    {
        Hf      0;
        Cp      450;
    }
    equationOfState
    {
        rho     8000;
    }
}


// ************************************************************************* //
