Appendix1/0/pipe/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    location    "0/pipe";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Uinlet          (0.01 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    leftLet
    {
        		type            codedFixedValue;
			value           uniform (0 0 0);
			
			name inletLaminarProfil;
			code
			#{
			     const fvPatch& boundaryPatch = patch(); 
			     const vectorField& Cf = boundaryPatch.Cf();
			     vectorField& field = *this;

			     const scalar yc  	= 	0.06; 
			     const scalar H	        = 	0.05;
			     const scalar Uinlet  = 	0.01; 

			     forAll(Cf, faceI) 
			     {
				const scalar x = Cf[faceI].x(); 
				const scalar y = Cf[faceI].y(); 
				const scalar z = Cf[faceI].z(); 

				field[faceI] = vector( 1.5 * Uinlet * ( 1 - ( ((yc-y)/H)*((yc-y)/H) )) ,0,0); 
			     }

			#};
    }
    rightLet	//outlet
    {
        type            zeroGradient;  
    }
    frontAndBack
    {
        type            empty;
    }
    pipe_to_bottomSolid 	//interfaces
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    pipe_to_topSolid		//intefaces
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
