Appendix1/0/pipe/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class          volScalarField;
    location    "0/pipe";
    object        p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pInitial       1e5;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pInitial;

boundaryField
{
    leftLet	//inlet
    {
        type            calculated;
        value           uniform $pInitial;
    }
    rightLet	//outlet
    {
        type            calculated;
        value           uniform $pInitial;
    }
    frontAndBack
    {
        type            empty;
    }
    pipe_to_bottomSolid	//interfaces
    {
        type            calculated;
        value           uniform $pInitial;
    }
    pipe_to_topSolid	//interfaces	
    {
        type            calculated;
        value           uniform $pInitial;
    }
}


// ************************************************************************* //
