Appendix1/0/topSolid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0/topSolid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pInitial	          1e5;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pInitial;

boundaryField
{
    ".*"
    {
        type            calculated;
        value           uniform $pInitial;
    }
}


// ************************************************************************* //
