Appendix1/0/bottomSolid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class          volScalarField;
    location    "0/bottomSolid";
    object       T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Tinitial	          300;

dimensions      [0 0 0 1 0 0 0];

internalField     uniform $Tinitial;

boundaryField
{
    bottomSolid_bottom	
    {
        type            fixedValue;
        value           uniform 500;
    }
    leftLet	 //inlet
    {
        type            zeroGradient;
    }
    rightLet	 //outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    bottomSolid_to_pipe	
    {
        type                      compressible::turbulentTemperatureCoupledBaffleMixed;
        value                     $internalField;
        Tnbr                      T;
        kappaMethod     solidThermo;
        kappaName         none;
    }
}

// ************************************************************************* //
