Appendix1/0/pipe/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0/pipe";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    leftLet	//inlet
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    rightLet	//outlet
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    frontAndBack
    {
        type            empty;
    }
    pipe_to_bottomSolid	//interfaces
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }
    pipe_to_topSolid	//interfaces
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
