Appendix1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                |
|   \\  /    A nd           | Web:      www.openfoam.com                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class         dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
}

gradSchemes
{
}

divSchemes
{
}

laplacianSchemes
{
    default                   Gauss linear corrected;
    laplacian(kappa,T)  Gauss linear corrected;
}


interpolationSchemes
{
}

snGradSchemes
{
}

fluxRequired
{
}


// ************************************************************************* //
