Appendix1/system/pipe/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                |
|   \\  /    A nd           | Web:      www.openfoam.com                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class        dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default               none;
    div(phi,U)            Gauss upwind;
    
    energy                     Gauss upwind;
    div(phi,K)                 $energy;
    div(phi,h)                 $energy;

    turbulence               Gauss upwind;
    div(phi,k)                  $turbulence;
    div(phi,epsilon)       $turbulence;
    div(phi,R)                  $turbulence;

    div(R)                                                      Gauss linear;
    div(Ji,Ii_h)                                              Gauss linearUpwind grad(U);
    div(((rho*nuEff)*dev2(T(grad(U)))))   Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
