Appendix1/system/cuttingPlane
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                |
|   \\  /    A nd           | Web:      www.openfoam.com                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
{
    type                          surfaces;
    libs                           (sampling);
    writeControl           writeTime;
    surfaceFormat       vtk; 
    fields                        (U T p grad(T));
    surfaces
{
            xNormal_0
            {
                type        cuttingPlane;
                point       (0.001000 0 0);
                normal      (1 0 0);
            }
            xNormal_1
            {
                type        cuttingPlane;
                point       (0.036667 0 0);
                normal      (1 0 0);
            }
            xNormal_2
            {
                type        cuttingPlane;
                point       (0.073333 0 0);
                normal      (1 0 0);
            }
            xNormal_3
            {
                type        cuttingPlane;
                point       (0.110000 0 0);
                normal      (1 0 0);
            }
            xNormal_4
            {
                type        cuttingPlane;
                point       (0.146667 0 0);
                normal      (1 0 0);
            }
            xNormal_5
            {
                type        cuttingPlane;
                point       (0.183333 0 0);
                normal      (1 0 0);
            }
            xNormal_6
            {
                type        cuttingPlane;
                point       (0.220000 0 0);
                normal      (1 0 0);
            }
            xNormal_7
            {
                type        cuttingPlane;
                point       (0.256667 0 0);
                normal      (1 0 0);
            }
            xNormal_8
            {
                type        cuttingPlane;
                point       (0.293333 0 0);
                normal      (1 0 0);
            }
            xNormal_9
            {
                type        cuttingPlane;
                point       (0.330000 0 0);
                normal      (1 0 0);
            }
            xNormal_10
            {
                type        cuttingPlane;
                point       (0.366667 0 0);
                normal      (1 0 0);
            }
            xNormal_11
            {
                type        cuttingPlane;
                point       (0.403333 0 0);
                normal      (1 0 0);
            }
            xNormal_12
            {
                type        cuttingPlane;
                point       (0.440000 0 0);
                normal      (1 0 0);
            }
            xNormal_13
            {
                type        cuttingPlane;
                point       (0.476667 0 0);
                normal      (1 0 0);
            }
            xNormal_14
            {
                type        cuttingPlane;
                point       (0.513333 0 0);
                normal      (1 0 0);
            }
            xNormal_15
            {
                type        cuttingPlane;
                point       (0.550000 0 0);
                normal      (1 0 0);
            }
            xNormal_16
            {
                type        cuttingPlane;
                point       (0.586667 0 0);
                normal      (1 0 0);
            }
            xNormal_17
            {
                type        cuttingPlane;
                point       (0.623333 0 0);
                normal      (1 0 0);
            }
            xNormal_18
            {
                type        cuttingPlane;
                point       (0.660000 0 0);
                normal      (1 0 0);
            }
            xNormal_19
            {
                type        cuttingPlane;
                point       (0.696667 0 0);
                normal      (1 0 0);
            }
            xNormal_20
            {
                type        cuttingPlane;
                point       (0.733333 0 0);
                normal      (1 0 0);
            }
            xNormal_21
            {
                type        cuttingPlane;
                point       (0.770000 0 0);
                normal      (1 0 0);
            }
            xNormal_22
            {
                type        cuttingPlane;
                point       (0.806667 0 0);
                normal      (1 0 0);
            }
            xNormal_23
            {
                type        cuttingPlane;
                point       (0.843333 0 0);
                normal      (1 0 0);
            }
            xNormal_24
            {
                type        cuttingPlane;
                point       (0.880000 0 0);
                normal      (1 0 0);
            }
            xNormal_25
            {
                type        cuttingPlane;
                point       (0.916667 0 0);
                normal      (1 0 0);
            }
            xNormal_26
            {
                type        cuttingPlane;
                point       (0.953333 0 0);
                normal      (1 0 0);
            }
            xNormal_27
            {
                type        cuttingPlane;
                point       (0.990000 0 0);
                normal      (1 0 0);
            }
            xNormal_28
            {
                type        cuttingPlane;
                point       (1.026667 0 0);
                normal      (1 0 0);
            }
            xNormal_29
            {
                type        cuttingPlane;
                point       (1.063333 0 0);
                normal      (1 0 0);
            }
            xNormal_30
            {
                type        cuttingPlane;
                point       (1.100000 0 0);
                normal      (1 0 0);
            }
            xNormal_31
            {
                type        cuttingPlane;
                point       (1.136667 0 0);
                normal      (1 0 0);
            }
            xNormal_32
            {
                type        cuttingPlane;
                point       (1.173333 0 0);
                normal      (1 0 0);
            }
            xNormal_33
            {
                type        cuttingPlane;
                point       (1.210000 0 0);
                normal      (1 0 0);
            }
            xNormal_34
            {
                type        cuttingPlane;
                point       (1.246667 0 0);
                normal      (1 0 0);
            }
            xNormal_35
            {
                type        cuttingPlane;
                point       (1.283333 0 0);
                normal      (1 0 0);
            }
            xNormal_36
            {
                type        cuttingPlane;
                point       (1.320000 0 0);
                normal      (1 0 0);
            }
            xNormal_37
            {
                type        cuttingPlane;
                point       (1.356667 0 0);
                normal      (1 0 0);
            }
            xNormal_38
            {
                type        cuttingPlane;
                point       (1.393333 0 0);
                normal      (1 0 0);
            }
            xNormal_39
            {
                type        cuttingPlane;
                point       (1.430000 0 0);
                normal      (1 0 0);
            }
            xNormal_40
            {
                type        cuttingPlane;
                point       (1.466667 0 0);
                normal      (1 0 0);
            }
            xNormal_41
            {
                type        cuttingPlane;
                point       (1.503333 0 0);
                normal      (1 0 0);
            }
            xNormal_42
            {
                type        cuttingPlane;
                point       (1.540000 0 0);
                normal      (1 0 0);
            }
            xNormal_43
            {
                type        cuttingPlane;
                point       (1.576667 0 0);
                normal      (1 0 0);
            }
            xNormal_44
            {
                type        cuttingPlane;
                point       (1.613333 0 0);
                normal      (1 0 0);
            }
            xNormal_45
            {
                type        cuttingPlane;
                point       (1.650000 0 0);
                normal      (1 0 0);
            }
            xNormal_46
            {
                type        cuttingPlane;
                point       (1.686667 0 0);
                normal      (1 0 0);
            }
            xNormal_47
            {
                type        cuttingPlane;
                point       (1.723333 0 0);
                normal      (1 0 0);
            }
            xNormal_48
            {
                type        cuttingPlane;
                point       (1.760000 0 0);
                normal      (1 0 0);
            }
            xNormal_49
            {
                type        cuttingPlane;
                point       (1.796667 0 0);
                normal      (1 0 0);
            }
            xNormal_50
            {
                type        cuttingPlane;
                point       (1.833333 0 0);
                normal      (1 0 0);
            }
            xNormal_51
            {
                type        cuttingPlane;
                point       (1.870000 0 0);
                normal      (1 0 0);
            }
            xNormal_52
            {
                type        cuttingPlane;
                point       (1.906667 0 0);
                normal      (1 0 0);
            }
            xNormal_53
            {
                type        cuttingPlane;
                point       (1.943333 0 0);
                normal      (1 0 0);
            }
            xNormal_54
            {
                type        cuttingPlane;
                point       (1.980000 0 0);
                normal      (1 0 0);
            }
            xNormal_55
            {
                type        cuttingPlane;
                point       (2.016667 0 0);
                normal      (1 0 0);
            }
            xNormal_56
            {
                type        cuttingPlane;
                point       (2.053333 0 0);
                normal      (1 0 0);
            }
            xNormal_57
            {
                type        cuttingPlane;
                point       (2.090000 0 0);
                normal      (1 0 0);
            }
            xNormal_58
            {
                type        cuttingPlane;
                point       (2.126667 0 0);
                normal      (1 0 0);
            }
            xNormal_59
            {
                type        cuttingPlane;
                point       (2.163333 0 0);
                normal      (1 0 0);
            }
            xNormal_60
            {
                type        cuttingPlane;
                point       (2.200000 0 0);
                normal      (1 0 0);
            }
    }
}
