Appendix1/system/pipe/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                |
|   \\  /    A nd           | Web:      www.openfoam.com                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class         dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
  
	U
	{
	    internalField   uniform (0 0 0);

	    boundaryField
	    {
		leftLet
		{
			type            codedFixedValue;
			value           uniform (0 0 0);
			
			name inletLaminarProfil;
			code
			#{
			     const fvPatch& boundaryPatch = patch(); 
			     const vectorField& Cf = boundaryPatch.Cf();
			     vectorField& field = *this;

			     const scalar yc  	= 	0.06;
			     const scalar H   	= 	0.05; 
			     const scalar Uinlet  = 	0.01;

			     forAll(Cf, faceI)
			     {
				const scalar x = Cf[faceI].x();
				const scalar y = Cf[faceI].y();
				const scalar z = Cf[faceI].z();

				field[faceI] = vector( 1.5 * Uinlet * ( 1 - ( ((yc-y)/H)*((yc-y)/H) )) ,0,0); 

			     }

			#};
		}

		rightLet
		{
		    type                   inletOutlet;
		    inletValue         uniform ( 0 0 0 );
		    value                 uniform ( 0 0 0 );
		}
		
		"pipe_to_.*"
		{
		    type            fixedValue;
		    value           uniform ( 0 0 0 );
		}
	    }
	}

	T
	{
	    internalField   uniform 300;

	    boundaryField
	    {
		leftLet
		{
		    type            fixedValue;
		    value           uniform 300;
		}

		rightLet
		{
		    type            zeroGradient;
		}

		"pipe_to_.*"
		{
		    type            compressible::turbulentTemperatureCoupledBaffleMixed;
		    Tnbr            T;
		    kappaMethod     fluidThermo;
		    kappaName       none;
		}
	    }
	}

	epsilon
	{
	    internalField   uniform 0.01;

	    boundaryField
	    {
		leftLet
		{
		    type            inletOutlet;
		    inletValue      uniform 0.01;
		    value           uniform 0.01;
		}

		rightLet
		{
		    type            fixedValue;
		    value           uniform 0.01;
		}

		"pipe_to_.*"
		{
		    type            compressible::epsilonWallFunction;
		    value           uniform 0.01;
		}
	    }
	}

	k
	{
	    internalField   uniform 0.1;

	    boundaryField
	    {
		leftLet
		{
		    type            inletOutlet;
		    inletValue      uniform 0.1;
		    value           uniform 0.1;
		}

		rightLet
		{
		    type            fixedValue;
		    value           uniform 0.1;
		}

		"pipe_to_.*"
		{
		    type            compressible::kqRWallFunction;
		    value           uniform 0.1;
		}
	    }
	}

	p_rgh
	{
	    internalField   uniform 1e5;

	    boundaryField
	    {
		".*"
		{
		    type            fixedFluxPressure;
		    value           uniform 1e5;
		}

		rightLet
		{
		    type            fixedMean;
		    meanValue       uniform 1e5;
		    value           uniform 1e5;
		}

		frontAndBack
		{
		    type            empty;
		}

	    }
	}

	p
	{
	    internalField   uniform 1e5;

	    boundaryField
	    {
		".*"
		{
		    type            calculated;
		    value           uniform 1e5;
		}

		leftLet
		{
		    type            calculated;
		    value           uniform 1e5;
		}

		frontAndBack
		{
		    type            empty;
		}
	    }
	}
}
// ************************************************************************* //
